backend/app/controllers/api/v1/auth/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@band.com"], ["LIMIT", 1]]
---
        def login
          user = User.find_by(email: params[:email]&.downcase)