backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def authenticate_admin
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = jwt_decode(token)
      @current_user = User.find(decoded[:user_id])