backend/app/controllers/api/v1/galleries_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."photo_gallery_id" IN ($1, $2)  [["photo_gallery_id", 1], ["photo_gallery_id", 2]]
---
      def index
        galleries = PhotoGallery.published.ordered.includes(:photos)

SELECT "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."published" = $1 AND "photo_galleries"."id" = $2 LIMIT $3  [["published", true], ["id", 1], ["LIMIT", 1]]
---
      def show
        gallery = PhotoGallery.published.find(params[:id])