backend/app/controllers/api/v1/admin/band_controller.rb

UPDATE "bands" SET "updated_at" = $1, "about_content" = $2 WHERE "bands"."id" = $3  [["updated_at", "2026-02-18 14:56:54.194597"], ["about_content", "blah blah"], ["id", 1]]
---
        def update
          band = Band.instance

          band.assign_attributes(band_params)

          if band.save