backend/app/controllers/api/v1/admin/band_members_controller.rb

INSERT INTO "band_members" ("name", "role", "position", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Johnny Licks"], ["role", "Guitar & Vocals"], ["position", 0], ["published", true], ["created_at", "2026-02-18 02:55:54.119032"], ["updated_at", "2026-02-18 02:55:54.119032"]]
---
        def create
          band_member = BandMember.new(band_member_params)

          if band_member.save

UPDATE "band_members" SET "updated_at" = $1 WHERE "band_members"."id" = $2  [["updated_at", "2026-02-18 02:55:54.184416"], ["id", 1]]
---
        def update
          band_member = BandMember.find(params[:id])

          if band_member.update(band_member_params)