backend/app/controllers/api/v1/admin/epk_contacts_controller.rb

INSERT INTO "epk_contacts" ("contact_type", "name", "email", "phone", "company", "territory", "position", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        def create
          epk_contact = EpkContact.new(epk_contact_params)

          if epk_contact.save