backend/app/controllers/api/v1/admin/events_controller.rb

        def index
          events = Event.order(date: :desc)
---
SELECT "events".* FROM "events" ORDER BY "events"."date" DESC