backend/app/controllers/api/v1/admin/galleries_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."photo_gallery_id" IN ($1, $2)  [["photo_gallery_id", 1], ["photo_gallery_id", 2]]
---
        def index
          galleries = PhotoGallery.ordered.includes(:photos)

INSERT INTO "photo_galleries" ("title", "description", "position", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Live Shows"], ["description", ""], ["position", 0], ["published", true], ["created_at", "2026-02-16 20:54:23.627992"], ["updated_at", "2026-02-16 20:54:23.627992"]]
---
        def create
          gallery = PhotoGallery.new(gallery_params)

          if gallery.save

UPDATE "photo_galleries" SET "updated_at" = $1 WHERE "photo_galleries"."id" = $2  [["updated_at", "2026-02-16 20:54:23.676579"], ["id", 1]]
---
        def update
          gallery = PhotoGallery.find(params[:id])

          if gallery.update(gallery_params)