backend/app/controllers/api/v1/admin/photos_controller.rb

        def create
          gallery = PhotoGallery.find(params[:gallery_id])
          photo = gallery.photos.new(photo_params)

          if photo.save
---
SELECT "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "photos" ("photo_gallery_id", "caption", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["photo_gallery_id", 1], ["caption", ""], ["position", 0], ["created_at", "2026-02-16 20:54:37.203469"], ["updated_at", "2026-02-16 20:54:37.203469"]]

        def update
          photo = Photo.find(params[:id])

          if photo.update(photo_params)
---
UPDATE "photos" SET "updated_at" = $1 WHERE "photos"."id" = $2  [["updated_at", "2026-02-16 20:54:37.265838"], ["id", 1]]