backend/app/controllers/api/v1/admin/press_quotes_controller.rb

        def destroy
          press_quote = PressQuote.find(params[:id])
          press_quote.destroy
---
SELECT "press_quotes".* FROM "press_quotes" WHERE "press_quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "press_quotes" WHERE "press_quotes"."id" = $1  [["id", 1]]