backend/app/controllers/api/v1/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
        def index
          users = User.order(created_at: :desc)

INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "jparsons5000@gmail.com"], ["password_digest", "[FILTERED]"], ["role", "admin"], ["created_at", "2026-02-18 02:22:57.180139"], ["updated_at", "2026-02-18 02:22:57.180139"]]
---
        def create
          user = User.new(user_params)

          if user.save