backend/app/controllers/api/v1/admin/videos_controller.rb

INSERT INTO "videos" ("title", "embed_url", "description", "position", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
        def create
          video = Video.new(video_params)

          if video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 2]]
---
        def destroy
          video = Video.find(params[:id])
          video.destroy